Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: From mechanical point of view, the application of mechanical load might be a challenge.
it_it: Dal punto di vista meccanico, l'applicazione del carico meccanico potrebbe rappresentare una sfida.

source: From the decoder’s perspective:
it_it: Dal punto di vista del decoder:

source: From the host’s perspective:
it_it: Dal punto di vista dell'host:

source: From the rotor point of view, there is a magnetic field pulling or pushing more or less that causes a phase shift between the magnetic field direction of the rotor and the magnetic field direction of the rotating field of the stator.
it_it: Dal punto di vista del rotore, c'è un campo magnetico che tira o spinge più o meno, causando uno sfasamento tra la direzione del campo magnetico del rotore e la direzione del campo magnetico del campo rotante dello statore.

source: From these considerations, a motor will give a more precise StallGuard signal, when it has lower resistive losses within the coil.
it_it: Da queste considerazioni, un motore fornirà un segnale StallGuard più preciso quando presenta minori perdite resistive all'interno della bobina.

source: Further, it is a safe hardware function whenever an emergency stop not coupled to software is required.
it_it: Inoltre, si tratta di una funzione hardware sicura ogni volta che è richiesto un arresto di emergenza non accoppiato al software.

source: Furthermore, by eliminating the current safety margin and allowing for temporary current boost, cool step allows for smaller motor since less stop reserve is required.
it_it: Inoltre, eliminando il margine di sicurezza della corrente e consentendo un aumento temporaneo della corrente, Cool Step consente di utilizzare motori più piccoli, poiché è richiesta una minore riserva di arresto.

source: General Configuration Registers
it_it: Registri di Configurazione Generale

source: Generally, there are a couple of SGT values that give sufficient StallGuard2 values SG.
it_it: In genere, ci sono un paio di valori di SGT che forniscono valori di StallGuard2 SG sufficienti.

source: Going close to stall but avoiding it is possible by choosing a lower current for stepper motor #2.
it_it: È possibile avvicinarsi allo stallo, ma evitarlo, scegliendo una corrente inferiore per il motore passo-passo n. 2.

source: HOST CTS: Driven by decoder RTS.
it_it: HOST CTS: Controllato dall'RTS del decoder.

source: HOST RTS: Host demand / interrupt to transmit.
it_it: HOST RTS: Demand / interrupt della trasmissione dell'host.

source: HOST RXD: Serial data receive input.
it_it: HOST RXD: Input di ricezione dati seriali..

source: HOST TXD: Serial data transmit output.
it_it: HOST TXD: Output di trasmissione dati seriali..

source: Half current is best for most applications that are compatible with CoolStep.
it_it: L'impostazione di metà corrente è la migliore per la maggior parte delle applicazioni compatibili con CoolStep.

source: Half current results in 25% power dissipation because the power dissipation is proportional to the square of the current.
it_it: L'impostazione di metà corrente comporta una dissipazione di potenza del 25%, poiché la dissipazione di potenza è proporzionale al quadrato della corrente.

source: Hardware Handshaking
it_it: Handshaking Hardware

source: Hardware Signals
it_it: Segnali Hardware

source: Hence, reading multiple registers can be done in a pipelined fashion.
it_it: Pertanto, la lettura di più registri può essere eseguita in modalità pipeline.

source: Here CS refers to current scaling, which is the motor current we already set in the current setting.
it_it: Qui CS si riferisce alla scala di corrente, ovvero la corrente del motore che abbiamo già impostato nell'impostazione corrente.

source: Here in the velocity rps, if we enter 1 and press enter, we can find out that it is equal to 53687 pulse per time in the internal unit of the device.
it_it: Qui, nella velocità rps, se inseriamo 1 e premiamo Invio, scopriamo che è pari a 53687 impulsi al tempo nell'unità di misura interna del dispositivo.

source: Here we can see that the target velocity is written in PPT which is pulse per time which is an internal unit of the device.
it_it: Qui possiamo vedere che la velocità target è espressa in PPT, ovvero impulsi al tempo, un'unità di misura interna del dispositivo.

source: Hi, my name is Gurkan Noor.
it_it: Ciao, mi chiamo Gurkan Noor.

source: High precision sensorless load measurement using the back EMF on the coils.
it_it: Misurazione del carico sensorless ad alta precisione utilizzando la forza controelettromotrice (EMF) sulle bobine.

source: High-precision chopper algorithm for highly dynamic motion and absolutely clean current wave.
it_it: Algoritmo chopper ad alta precisione per un movimento altamente dinamico e un'onda di corrente assolutamente pulita.

source: Highest energy efficiency at speed limit
it_it: Massima efficienza energetica al limite di velocità

source: Highest possible acceleration automatically
it_it: Massima accelerazione possibile automaticamente

source: Hint
it_it: Suggerimento

source: Host Demand / Interrupt to receive.
it_it: Host Demand / Interrupt per la ricezione.

source: Host Input.
it_it: Input dell'Host.

source: Host Reception Sample Code
it_it: Codice di Esempio di Ricezione Host

source: Host Reception of Decoder Transmission
it_it: Ricezione Host della Trasmissione del Decoder

source: Host Transmission
it_it: Trasmissione Host

source: Host Transmission Sample Code
it_it: Codice di Esempio per la Trasmissione dell'Host

source: Host Transmission to Decoder
it_it: Trasmissione dall'Host al Decoder

source: Host command to update Custom Defaults Buffer.
it_it: Comando host per aggiornare il buffer dei valori predefiniti personalizzati.

source: How do I select an optimum motor for StallGuard?
it_it: Come si seleziona un motore ottimale per StallGuard?

source: How to Apply Mechanical Load
it_it: Come Applicare il Carico Meccanico

source: However, SG_RESULT has a range of 0...510.
it_it: Tuttavia, SG_RESULT ha un intervallo compreso tra 0 e 510.

source: However, for our cDriver IC’s (e.g., TMC5130A) this is a register that must be set.
it_it: Tuttavia, per i nostri circuiti integrati cDriver (ad esempio, TMC5130A) questo è un registro che deve essere impostato.

source: However, it helps prevent host receiver overrun.
it_it: Tuttavia, aiuta a prevenire il sovraccarico del ricevitore host.

source: However, the end of the reset condition cannot be determined by monitoring DIAG0 in this configuration, because event_pos_reached flag also becomes active upon reset and thus the pin stays actively low after the reset condition.
it_it: Tuttavia, la fine della condizione di reset non può essere determinata monitorando DIAG0 in questa configurazione, perché anche il flag event_pos_reached diventa attivo al momento del ripristino e quindi il pin rimane attivamente basso dopo la condizione di reset.

source: However, there are many different uses of StallGuard, like load detection and load dependent motor current control (CoolStep).
it_it: Tuttavia, StallGuard può essere utilizzato in molti modi diversi, come il rilevamento del carico e il controllo della corrente del motore in base al carico (CoolStep).

source: I am an applications engineer here at Maxim Integrated.
it_it: Sono un ingegnere applicativo presso Maxim Integrated.

source: Identifies the type of packet data sent.
it_it: dentifica il tipo di dati del pacchetto inviati.

source: Identifies this Opcode type.
it_it: Identifica questo tipo di Opcode.

source: Identifies where the message is coming from.
it_it: Identifica la provenienza del messaggio.

source: If SG_RESULT goes below this threshold, CoolStep increases the current to both coils.
it_it: Se SG_RESULT scende al di sotto di questa soglia, CoolStep aumenta la corrente in entrambe le bobine.

source: If SG_RESULT is sampled equal to or above this threshold enough times, CoolStep decreases the current to both coils.
it_it: Se SG_RESULT viene campionato a un valore uguale o superiore a questa soglia per un numero sufficiente di volte, CoolStep riduce la corrente in entrambe le bobine.

source: If SG_RESULT reaches zero before the motor stalls, increase SGT.
it_it: Se SG_RESULT raggiunge zero prima che il motore vada in stallo, aumentare SGT.

source: If ACK/NAK handshaking is enabled, the decoder ACKs if a valid beep code is requested.
it_it: Se l'handshake ACK/NAK è abilitato, il decoder conferma se viene richiesto un segnale acustico valido.

source: If StallGuard2 requires the SGT value to be outside the range of -10… +10, the adjustment might be challenging.
it_it: Se StallGuard2 richiede che il valore SGT sia al di fuori dell'intervallo -10… +10, la regolazione potrebbe risultare complessa.

source: If a CMD_NAK checksum message occurs, the decoder retransmits the packet that was NAK'd.
it_it: Se si verifica un messaggio di checksum CMD_NAK, il decoder ritrasmette il pacchetto che è stato segnalato come NAK.

source: If an application works with other than 50% or 25% current reduction, you can do this under software control.
it_it: Se un'applicazione funziona con una riduzione di corrente diversa dal 50% o dal 25%, è possibile farlo tramite controllo software.

source: If enabled, all packeted messages must have a response in the form of an ACK, or a NAK of various types.
it_it: Se abilitato, tutti i messaggi in pacchetti devono ricevere una risposta sotto forma di ACK o NAK di vario tipo.

source: If it does not receive the response, the decoder tries to send two more times before issuing a host transmission error.
it_it: Se non riceve la risposta, il decoder tenta di inviare altri due messaggi prima di generare un errore di trasmissione dell'host.

source: If it goes to zero, no spare energy will be left and the motor may stall.
it_it: Se il valore scende a zero, non rimarrà più energia di riserva e il motore potrebbe andare in stallo.

source: If more than 40 bits are sent, only the last 40 bits received before the rising edge of CSN are recognized as the command.
it_it: Se vengono inviati più di 40 bit, solo gli ultimi 40 bit ricevuti prima del fronte di salita del CSN vengono riconosciuti come comando.

source: If more than 40 clocks are driven, the additional bits shifted into SDI are shifted out on SDO after a 40-clock delay through an internal shift register.
it_it: Se vengono gestiti più di 40 clock, i bit aggiuntivi trasferiti su SDI vengono spostati su SDO dopo un ritardo di 40 clock tramite un registro a scorrimento interno.

source: If set, reduces the measurement frequency to one measurement per electrical period of the motor (4 fullsteps).
it_it: Se impostato, riduce la frequenza di misurazione a una misurazione per periodo elettrico del motore (4 passi completi).

source: If the decoder does not respond with HOST CTS when it detects HOST RTS within the programmable (via parameters) response timeout, the host may retry the message.
it_it: Se il decoder non risponde con HOST CTS quando rileva HOST RTS entro il timeout di risposta programmabile (tramite parametri), l'host può ritentare l'invio del messaggio.

source: If the decoder receives a CMD_NAK from the host, it may attempt a retry depending on the cause field of the CMD_NAK message.
it_it: Se il decoder riceve un CMD_NAK dall'host, potrebbe tentare nuovamente a seconda del campo "cause" del messaggio CMD_NAK.

source: If the filter controlled by sfilt is enabled, the measurement rate and regulation speed are cut by a factor of four.
it_it: Se il filtro controllato da sfilt è abilitato, la velocità di misurazione e la velocità di regolazione vengono ridotte di un fattore quattro.

source: If the host detects the value is 1, it infers the user scanned either the Set Defaults bar code or Enable Parameter Scanning bar code.
it_it: Se l'host rileva che il valore è 1, deduce che l'utente ha scansionato il codice a barre "Set Defaults" o "Enable Parameter Scanning".

source: If the host did not send any characters, there is no message, so the decoder does not reply.
it_it: Se l'host non ha inviato alcun carattere, non c'è alcun messaggio, quindi il decoder non risponde.

source: If the host does not send any characters, the decoder resumes transmission when the HOST RTS line becomes inactive.
it_it: Se l'host non invia alcun carattere, il decoder riprende la trasmissione quando la linea HOST RTS diventa inattiva.

source: If the host exceeds the inter-character timeout delay, the decoder waits for de-assertion of the CTS line to send a NAK message to the host.
it_it: e l'host supera il timeout tra caratteri, il decoder attende la disattivazione della linea CTS per inviare un messaggio NAK all'host.

source: If the host is attempting to send, the decoder defers transmission and permits the host to send as described previously.
it_it: Se l'host sta tentando di inviare dati, il decoder rinvia la trasmissione e consente all'host di inviare dati come descritto in precedenza.

source: If the host is not trying to send, the decoder sends one character of the transmission on the TXD line.
it_it: Se l'host non sta tentando di inviare, il decoder invia un carattere della trasmissione sulla linea TXD.

source: If the host is overrun, it can use hardware handshaking to temporarily hold off the decoder.
it_it: Se l'host è sovraccarico, può utilizzare l'handshaking hardware per sospendere temporaneamente il decoder.

source: If the mechanical load on the motor increases to the stalling load, the motor automatically decreases velocity so that it can still drive the load.
it_it: Se il carico meccanico sul motore aumenta fino al carico di stallo, il motore riduce automaticamente la velocità in modo da poter comunque azionare il carico.

source: If the motor load changes slowly, a lower current increment step can be used to avoid motor oscillations.
it_it: Se il carico del motore cambia lentamente, è possibile utilizzare un gradino di incremento di corrente inferiore per evitare oscillazioni del motore.

source: If the motor stalls before SG_RESULT reaches zero, decrease SGT.
it_it: Se il motore si blocca prima che SG_RESULT raggiunga lo zero, ridurre SGT.

source: If the previous access was a write access, then the data read back mirrors the previously received write data.
it_it: Se l'accesso precedente era in scrittura, i dati riletti rispecchiano i dati di scrittura ricevuti in precedenza.

source: If the response is too slow, the motor may stall.
it_it: Se la risposta è troppo lenta, il motore potrebbe bloccarsi.

source: If the smartEnergy stall velocity is above the motor velocity, the motor will not stop if SG reaches 0.
it_it: Se la velocità di stallo smartEnergy è superiore alla velocità del motore, il motore non si arresta se SG raggiunge 0.

source: If the system clock is based on the on-chip oscillator, an additional 10% safety margin must be used to ensure reliable data transmission.
it_it: Se il clock di sistema è basato sull'oscillatore on-chip, è necessario utilizzare un margine di sicurezza aggiuntivo del 10% per garantire una trasmissione dati affidabile.

source: If there is a high mechanical load that can overload the motor, then the STOCK.2 feature comes into play by sending trigger signal to the control IC which in turn immediately stops the motor.
it_it: In caso di un carico meccanico elevato che può sovraccaricare il motore, la funzione StallGuard2 entra in gioco inviando un segnale di trigger al circuito integrato di controllo, che a sua volta arresta immediatamente il motore.

source: If this timeout has not expired and the host has not received the last character of the transmission, the host receives the next character.
it_it: Se questo timeout non è scaduto e l'host non ha ricevuto l'ultimo carattere della trasmissione, riceve il carattere successivo.

source: If this timeout is exceeded, the decoder waits for the host to de-assert HOST RTS.
it_it: Se questo timeout viene superato, il decoder attende che l'host disattivi l'HOST RTS.

source: If you purchased your Zebra business product from a Zebra business partner, please contact that business partner for support.
it_it: Se avete acquistato il vostro prodotto aziendale Zebra da un partner commerciale Zebra, contattate tale partner per ricevere assistenza.

source: If you set the SGT value in a way, that a reading of 0 occurs at maximum motor load, the stall can be automatically detected by the motion controller to issue a motor stop.
it_it: Impostando il valore SGT in modo che si verifichi una lettura pari a 0 al massimo carico del motore, lo stallo può essere rilevato automaticamente dal motion controller per arrestare il motore.

source: If your problem cannot be solved by Zebra Technologies support, you may need to return your equipment for servicing and will be given specific directions.
it_it: Se il problema non può essere risolto dall'assistenza Zebra Technologies, potrebbe essere necessario restituire l'apparecchiatura per la manutenzione e riceverete istruzioni specifiche.

source: If, however, the first character is sent, an incomplete message results in a NAK.
it_it: Se, tuttavia, viene inviato il primo carattere, un messaggio incompleto genera un NAK.

source: If, however, the host sends one or more characters, the decoder resends the entire packet from the start when the HOST RTS line becomes inactive.
it_it: Se, tuttavia, l'host invia uno o più caratteri, il decoder reinvia l'intero pacchetto dall'inizio quando la linea HOST RTS diventa inattiva.

source: In Figure 2.7 three different cases of load angles are outlined.
it_it: Nella Figura 2.7 sono illustrati tre diversi casi di angoli di carico.

source: In Figure 4.2 there are two bars on the right.
it_it: Nella Figura 4.2 sono presenti due barre sulla destra.

source: In a classical application, the operation area is limited by the maximum torque required at maximum application velocity.
it_it: In un'applicazione classica, l'area operativa è limitata dalla coppia massima richiesta alla massima velocità dell'applicazione.

source: In a practical application, especially when using CoolStep, a more precise measurement might be more important than an update for each fullstep because the mechanical load never changes instantaneously from one step to the next.
it_it: In un'applicazione pratica, soprattutto quando si utilizza CoolStep, una misurazione più precisa potrebbe essere più importante di un aggiornamento per ogni passo completo, poiché il carico meccanico non cambia mai istantaneamente da un passo all'altro.

source: In a production environment, it may be desirable to use a fixed SGT value within an application for one motor type.
it_it: In un ambiente di produzione, potrebbe essere opportuno utilizzare un valore SGT fisso all'interno di un'applicazione per un tipo di motore.

source: In addition to the increased torque at a lower velocity, dynamic inertia will allow the motor to overcome mechanical overloads by decelerating.
it_it: Oltre all'aumento di coppia a velocità inferiori, l'inerzia dinamica consentirà al motore di superare i sovraccarichi meccanici decelerando.

source: In addition to these performance enhancements, TRINAMIC motor drivers offer safeguards to detect and protect against shorted outputs, output open-circuit, overtemperature, and undervoltage conditions for enhancing safety and recovery from equipment malfunctions.
it_it: Oltre a questi miglioramenti delle prestazioni, i driver per motori TRINAMIC offrono protezioni per rilevare e proteggere da cortocircuiti in uscita, circuito aperto in uscita, sovratemperatura e condizioni di sottotensione, migliorando la sicurezza e il ripristino in caso di malfunzionamenti delle apparecchiature.

source: In addition, the dynamic change of current on the detection of mechanical load causes a dynamic change of mechanical load and that has an effect on the StallGuard2 vale SG, also.
it_it: Inoltre, la variazione dinamica della corrente al rilevamento del carico meccanico provoca una variazione dinamica del carico meccanico e ciò influisce anche sul valore SG di StallGuard2.

source: In applications with more than one operating point and when the operating points are spread over a wide velocity range it is recommended to use individual settings for these operating points if StallGuard2 is used.
it_it: Nelle applicazioni con più di un punto operativo e quando i punti operativi sono distribuiti su un ampio intervallo di velocità, si consiglia di utilizzare impostazioni individuali per questi punti operativi se si utilizza StallGuard2.

source: In case an external step source is used, the complete integrated motion controller can be switched off at any time.
it_it: Nel caso in cui venga utilizzata una sorgente di passo esterna, l'intero motion controller integrato può essere spento in qualsiasi momento.

source: In case of a microcontroller software re-boot, disable the driver (TOFF=0), re-initialize all registers used by the software and stop any motion in progress by slowing down the ramp generator.
it_it: In caso di riavvio del software del microcontrollore, disabilitare il driver (TOFF=0), reinizializzare tutti i registri utilizzati dal software e arrestare qualsiasi movimento in corso rallentando il generatore di rampa.

source: In case read-modify-write access is desired for a write only register, a shadow register can be realized in master software.
it_it: Nel caso in cui si desideri un accesso in lettura-modifica-scrittura per un registro di sola scrittura, è possibile realizzare un registro ombra nel software master.

source: In case the external CLK fails, it is not safe to disable ENN.
it_it: Nel caso in cui il CLK esterno fallisca, non è sicuro disabilitare ENN.

source: In case the motor becomes completely blocked, the stall flag becomes set.
it_it: Nel caso in cui il motore si blocchi completamente, viene impostato il flag di stallo.

source: In case the motor becomes overloaded, it slows down to a velocity, where the motor can still drive the load.
it_it: Nel caso in cui il motore venga sovraccaricato, rallenta fino a raggiungere una velocità alla quale il motore può ancora azionare il carico.

source: In cases of collision or arbitration, the decoder always defers to the actions of the host.
it_it: In caso di collisione o arbitraggio, il decoder si affida sempre alle azioni dell'host.

source: In contrast, a slow response to crossing the upper threshold does not risk anything more serious than missing an opportunity to save power.
it_it: Al contrario, una risposta lenta al superamento della soglia superiore non comporta alcun rischio più grave che perdere l’opportunità di risparmiare energia.

source: In figure 3.3 you can see that as the current increases (red line) the StallGuard value (blue line) does not change in the same way as it did for StallGuard2.
it_it: Nella figura 3.3 si può vedere che all'aumentare della corrente (linea rossa) il valore di StallGuard (linea blu) non cambia come per StallGuard2.

source: In many applications, operation at or near a single operation point is used most of the time and a single setting is sufficient.
it_it: In molte applicazioni, il funzionamento in corrispondenza o in prossimità di un singolo punto operativo viene utilizzato per la maggior parte del tempo e una singola impostazione è sufficiente.
